app/controllers/api/v1/category_leaderboards_controller.rb

      def index
        categories=CategoryLeaderboard.all
---
SELECT "category_leaderboards".* FROM "category_leaderboards"