app/controllers/api/v1/runners_controller.rb

SELECT "runners".* FROM "runners"
---
      def index
        filtered_runners=[]
        runners=Runner.all