app/controllers/api/v1/runs_controller.rb

SELECT "category_leaderboards".* FROM "category_leaderboards"
SELECT "runs".* FROM "runs" WHERE "runs"."runner_id" = $1  [["runner_id", 1]]
---
      def index
        if params[:limit]
          runs = Run.all.limit(10).includes(:runner, :game, :category_leaderboard)